//'number' + 3 + 3 -> number33  Пояснення: конкатенація

//null + 3 -> 3    Пояснення: 0+3=3

//5 && "qwerty" -> qwerty  Пояснення: 5 та "qwerty" це true.  Логічне && повертає в цьому випадку останнє true - qwerty

//+'40' + +'2' + "hillel" -> 42hillel  Пояснення: унарний плюс перетворює '40' та '2' на числа - їх сума буде 42. Потім конкатенація 42 та "hillel"  

//'10' - 5 === 6 -> false Пояснення: '10' - 5 = 5. 5 не дорівнює 6, тому результат false

//true + false -> 1 Пояснення: true це 1, false це 0. 1+0=1

//'4px' - 3 -> NaN Пояснення: '4px' буде NaN - не може стати числом  NaN - 3 = NaN

//'4' - 3 -> 1 Пояснення: '4' перетворюється на число 4. 4-3=1

//'6' + 3 ** 0 -> 61 Пояснення: спочатку піднесення до степеня. 3 в нульовому степені це 1. Потім конкатенація 6 та 1. Результат 61

//12 / '6' -> 2 Пояснення: '6' перетворюється на число  12 поділити на 6 дорівнює 2

//'10' + (5 === 6) -> 10false Пояснення: (5 === 6) це false. '10'+false = 10false конкатенація

//null == '' -> false Пояснення: null == null або null == undefined

//3 ** (9 / 3) -> 27 Пояснення: спочатку 9/3 = 3. Потім піднесення числа 3 до степеня 3

//!!'false' == !!'true' -> true Пояснення: Значення !!'false' це true , !!'true' це теж true. true == true

//0 || '0' && 1 -> 1 Пояснення: спочатку '0' && 1. Результат обідва true - повертає останнє. Результат 1. Потім 0 || 1. Повертає перше true значення. 0 це false. 1 це true. Результат 1

//(+null == false) < 1 -> false Пояснення: +null перетворюється на 0. false це теж 0. Тому (+null == false) це true. Потім true < 1. True це 1. Виходить 1<1. Це false

//false && true || true -> true Пояснення: Спочатку false && true повертає перше false. Потім false || true. Повертає перше true. 

//false && (false || true) -> false Пояснення: Спочатку (false || true) Повертає перше true Потім false && true. Повертає перше false.

//(+null == false) < 1 ** 5 -> false Пояснення: Спочатку піднесення до степеня 1 ** 5 це 1. Потім +null  це 0. Потім 0 == false це true бо false це 0. Потім true < 1 Виходить 1<1. Це false